[
    {
        "title": "Solo Learning",
        "headline": "The Quiet Journey of Self-Taught Web Development.",
        "content": "<p>I didn’t have many close friends, and even in college, I only had a few people I could really connect with. Our interests often didn’t align, and the more I dived into web development, the more it felt like I was walking a solitary path. I found myself learning on my own, without any study partners or a group to collaborate with.</p><p>Being an introvert added to the challenge. I struggled to step into communities or find people to learn with. Maybe I was just too shy, or maybe I was afraid of putting myself out there, but whatever the reason, it made the process of learning even harder. There were times when I came across challenges and had no one to turn to for help. My only option was to rely on Google and AI for answers—solitary, yet somehow comforting, but still, it made me feel quite isolated.</p><p>Learning web development by myself often felt overwhelming, as there was so much to figure out on my own. The journey was both rewarding and tough, and though I’ve made it this far, I sometimes wonder how much more I could have learned with the right support and collaboration.</p><p>But I’ve come to realize that while learning alone can be lonely, it’s also shaped me into a more independent learner. I’ve learned to embrace the challenges, become resourceful, and trust my own instincts. Sure, there are times I wish I had a learning partner or mentor, but I know that the journey is mine to take. And who knows, maybe one day I’ll have the opportunity to collaborate with others who share the same passion for web development.</p>",
        "created_at": "2024-11-10"
    },
    {
        "title": "My Web Development Journey So Far",
        "headline": "How I Began with Web Development.",
        "content": "<p>In the early stages of my journey into web development, I began with front-end development, starting with HTML and CSS. My initial focus was on building basic webpage structures and experimenting with design, as I already had an interest in graphic design before diving into web development. This background made learning and applying HTML and CSS both engaging and rewarding, as I could see my designs take shape on the web.</p><p>As I became more comfortable with HTML and CSS, I realized that static pages weren’t enough—I wanted my websites to be more interactive and dynamic. This curiosity led me to learn JavaScript. Initially, I focused on DOM manipulation and understanding the basics of JavaScript, which was relatively straightforward since I was already familiar with foundational programming concepts like loops and conditional statements.</p><p>Over time, as I grew more comfortable with front-end development, I realized that I wanted to create dynamic applications that could handle real data. At this point, I had only worked with static data or external APIs. I decided to learn REST APIs because they are one of the most popular and widely used structures for web applications. When I started exploring, I discovered that REST APIs rely on the HTTP protocol, which powers communication on the web. This made REST not only an accessible option but also an essential skill for building interactive, responsive applications.</p><p>My journey into back-end development deepened from there. I began studying how to structure my own APIs, starting with the basics of HTTP requests, responses, and statuses. Eventually, I learned to build RESTful APIs using Express, and I chose MySQL as my database to store and retrieve data effectively. Diving into back-end work gave me a more comprehensive understanding of how web applications function and allowed me to create full-stack projects, connecting all parts of my application seamlessly.</p><p>Through this progression from front-end to back-end, I gained a more complete understanding of the entire web development process, and it’s been a rewarding journey to see my skills and projects evolve along the way.</p>",
        "created_at": "2024-11-09"
    },
    {
        "title": "Why and How I Chose Web Development",
        "headline": "How Web Development Became My Passion Despite the Odds.",
        "content": "<p>My journey into web development began during my time in vocational high school (SMK). At my school, we were introduced to various fields of programming, including web development, desktop applications, and mobile development. However, I was limited by the outdated specifications of my laptop—a Vaio with only 2GB of RAM and running on Windows XP. In 2017, this setup was already considered quite obsolete, and my laptop struggled to handle more demanding tasks like developing desktop or mobile applications. My laptop simply couldn’t handle the demands of other programming environments, which led me to focus solely on web development.</p> <p>Rather than feeling frustrated by the limitations, I decided to embrace what was within my reach. Web development turned out to be a perfect fit for me. It was lightweight enough to run on my underpowered laptop, and getting started was incredibly simple. All I needed was a browser (which, of course, was already installed) and a basic text editor. This made web development one of the easiest and most accessible fields to dive into, and it became the area where I could truly excel without constantly feeling behind my classmates in other programming disciplines. </p> <p>Over time, I grew more passionate about web development. The ability to create websites and applications that anyone could access with just a browser fascinated me. It was a field that offered immediate results and endless opportunities to learn and improve. What started as a necessity due to my hardware limitations eventually became a genuine interest and a career path I am excited to pursue.</p> <p>Although web development is where my focus has been, I am open to exploring other areas in technology. I recognize the value of continuous learning and am not limiting myself to just one field. The world of technology is vast, and I look forward to expanding my knowledge and skills in the future.</p>",
        "created_at": "2024-11-08"
    }
]